Tekla.Structures.ModelInternal.dotBuildingHierarchyItemType_e
Enumeration for all possible BuildingHierarchy object types.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemType_e.DOT_BUILDINGHIERARCHY_ITEM
Any building hierarchy item.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemType_e.DOT_BUILDINGHIERARCHY_PROJECT
The building hierarchy project.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemType_e.DOT_BUILDINGHIERARCHY_SITE
The building hierarchy site.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemType_e.DOT_BUILDINGHIERARCHY_BUILDING
The building hierarchy building.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemType_e.DOT_BUILDINGHIERARCHY_CHILDBUILDING
The building hierarchy child building.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemType_e.DOT_BUILDINGHIERARCHY_STOREY
The building hierarchy storey.